WildernessLabs/Meadow/configs/stm32f777zit6-meadow/src/meadow-upd-interrupt.c
  struct interruptPinMap_s *gpioMapTblPtr = (struct interruptPinMap_s *)arg;

  // Properly setup?
  if(gpioMapTblPtr == NULL)
  {
    syslog(LOG_ERR, "%s@%d-PinId:0x%02x <unconfigured> gpioMapTblPtr == NULL\n",
            __FILE__, __LINE__, gpioMapTblPtr->PinId);
    return OK;
  }

#if MEADOW_UPD_INCLUDE_DIAGNOSTIC_SYSLOG > 0
    syslog(LOG_INFO, "upd-(GPIO isr)-0x%02x (P%c%d)- received interrupt\n",
            gpioMapTblPtr->PinId,
            ((gpioMapTblPtr->PinId) >> 4) + 'A', gpioMapTblPtr->PinId & 0x0f);
#endif

  // Unless waiting for gpio interrupt, ignore
  if(gpioMapTblPtr->CurrentProcessState != updipstate_wait_gpio_isr)
  {
    // The updipstate_uncfg, updipstate_mon_glitch and updipstate_mon_debounce states
    // exit here. When work is finished the state is returned to updipstate_wait_gpio_isr.
    // Therefore, switch bouncing will exits here too
#if MEADOW_UPD_INCLUDE_DIAGNOSTIC_SYSLOG > 0
    syslog(LOG_INFO, "upd-(GPIO isr)--PinId:0x%02x ignored\n", gpioMapTblPtr->PinId);
#endif
    return OK;
  }

  // This GPIO is not being processed so begin processing
  upd_add_gpio_to_active_list(gpioMapTblPtr);

  // Check configuration to know what to do, glitch or debounce.
  // Note: Minimal processing is done here, just setup for the
  // timer to do the the real work.   
  if(gpioMapTblPtr->GlitchRequestedDuration > 0)
  {
#if MEADOW_UPD_INCLUDE_DIAGNOSTIC_SYSLOG > 0
    syslog(LOG_DEBUG, "upd-(GPIO isr)--PinId:0x%02x, Process glitch\n", gpioMapTblPtr->PinId);
#endif
    // Glitch always runs before Debounce if Debounce configured
    gpioMapTblPtr->GlitchTimeoutsCounter = 0;
    gpioMapTblPtr->CurrentProcessState = updipstate_mon_glitch;
    totalGpiosBeingMonitored++;
    STM32_TIM_SETMODE(_periodicTimer, STM32_TIM_MODE_UP);
  }
  else if(gpioMapTblPtr->DebounceRequestedDuration > 0)
  {
#if MEADOW_UPD_INCLUDE_DIAGNOSTIC_SYSLOG > 0
    syslog(LOG_DEBUG, "upd-(GPIO isr)--PinId:0x%02x, Process debounce\n", gpioMapTblPtr->PinId);
#endif

    gpioMapTblPtr->DebounceDownCounter = gpioMapTblPtr->DebounceRequestedDuration;
    gpioMapTblPtr->CurrentProcessState = updipstate_mon_debounce;
    totalGpiosBeingMonitored++;
    STM32_TIM_SETMODE(_periodicTimer, STM32_TIM_MODE_UP);
  }
  else
  {
    // Both Glitch and Debounce durations are zero and the interrupt mode is
    // set, so read the state and send it with no delay.
    uint8_t currentState = upd_read_current_gpio_state(gpioMapTblPtr);
    if(currentState == gpioMapTblPtr->LastKnownGpioState)
      return OK;

#if MEADOW_UPD_INCLUDE_DIAGNOSTIC_SYSLOG > 0
    syslog(LOG_DEBUG, "upd-(GPIO isr)--PinId:0x%02x, Glitch and Debounce zero. Notify as:0x%02x (was::0x%02x\n",
        gpioMapTblPtr->PinId, newState, gpioMapTblPtr->LastKnownGpioState);
#endif
    if(upd_forward_interrupt_to_core(gpioMapTblPtr, currentState) == OK)
      gpioMapTblPtr->LastKnownGpioState = currentState;
  }

  return OK;
}

//===============================================================
// This function is called every 100 microseconds when the timer
// is running
int upd_periodic_timeout_isr(int irq, void *context, void *arg)
{
  int result;
  struct interruptPinMap_s *gpioMapTblPtr;

  // Acknowledge timer interrupt. Fortunately at this point we don't
  // care about which GPIO this is for.
  STM32_TIM_ACKINT(_periodicTimer, GTIM_SR_UIF);

  // Timer only needed if at least one gpio configured and active
  if(numbGpioConfigured == 0 || totalGpiosBeingMonitored == 0)
  {
    return OK;
  }

  // syslog(1, "0x%02x udp-(time isr)-Interrupt Context? %s\n",
  //           gpioMapTblPtr->PinId, up_interrupt_context() ? "YES" : "no");

  // Check all active GPIOs
  int offset = 0;
  while(activeGpioPins[offset] != NULL)
  {
    gpioMapTblPtr = activeGpioPins[offset++];
    
    // DEBUGASSERT(gpioMapTblPtr->CurrentProcessState == updipstate_mon_glitch ||
    //     gpioMapTblPtr->CurrentProcessState == updipstate_mon_debounce);
    // DEBUGASSERT(gpioMapTblPtr->CurrentProcessState != updipstate_wait_gpio_isr);

    // Monitoring Debounce or Glitch?
    if(gpioMapTblPtr->CurrentProcessState == updipstate_mon_debounce)
    {
      //----- Debounce Filtering -----
      result = upd_process_gpio_debounce(gpioMapTblPtr);
      if(result == gadrv_keepwaiting)
        continue;

      if(result == gadrv_break)
        break;
    }

    if(gpioMapTblPtr->CurrentProcessState == updipstate_mon_glitch)
    {
      //----- Glitch Filtering -----
      result = upd_process_gpio_glitch(gpioMapTblPtr);
      if(result == gadrv_keepwaiting)
        continue;

      // We reached the end of the glitch filtering
      // Should we switch to debounce?
      if(gpioMapTblPtr->DebounceRequestedDuration > 0 && result == gadrv_validtransitiondetected)
      {
        // Debounce is also configured for > 0 duration and this interrupt is not a "glitch"
        gpioMapTblPtr->DebounceDownCounter = gpioMapTblPtr->DebounceRequestedDuration;
        gpioMapTblPtr->CurrentProcessState = updipstate_mon_debounce;
        continue;
      }
      else
      {
        // Terminate glitch capture for this GPIO since nothing else to do
        upd_remove_gpio_from_active_list(gpioMapTblPtr);
        totalGpiosBeingMonitored--;
        gpioMapTblPtr->CurrentProcessState = updipstate_wait_gpio_isr;
        if(totalGpiosBeingMonitored == 0)
          break;    // Cannot be more work to do, so quit loop
      }
    }
  }

  // Stop Timer if no GPIO needs it
  if(totalGpiosBeingMonitored == 0)
  {
    int ret = STM32_TIM_SETMODE(_periodicTimer, STM32_TIM_MODE_DISABLED);
    if(ret < 0)
    {
      syslog(LOG_ERR, "%s@%d-0x%02x udp-(time isr)--STM32_TIM_SETMODE failed:%d\n",
                __FILE__, __LINE__, gpioMapTblPtr->PinId, ret);
    }
  }

  return OK;
}

//========================================================================
// Process debounce
int upd_process_gpio_debounce(struct interruptPinMap_s *gpioMapTblPtr)
{
  if(gpioMapTblPtr->DebounceDownCounter == gpioMapTblPtr->DebounceRequestedDuration)
  {
    // This is the first time to process this debounce filter request

#if MEADOW_UPD_INCLUDE_DIAGNOSTIC_SYSLOG > 0
    syslog(LOG_DEBUG, "upd-(deb)-0x%02x DEBOUNCE Starting\n", gpioMapTblPtr->PinId);
    gpioMapTblPtr->TimeProcessingBegan = clock_systimer();
#endif

    // In the case both Glitch and Debounce are requested, Gliitch has
    // already sent the interrupt, if it's going to. Only if  Glitch does
    // send an interrupt and debounce duration is > 0, will Debounce keep
    // new interrupts inactive until debounce duration has elasped.
    if(gpioMapTblPtr->GlitchRequestedDuration == 0)
    {
      // Glitch filtering not configured but Debounce was, so send
      // interrupt now.
      upd_meadow_debounce_notification_logic(gpioMapTblPtr);
    }
#if MEADOW_UPD_INCLUDE_DIAGNOSTIC_SYSLOG > 0
    else
    {
      syslog(LOG_DEBUG, "upd-(deb)-0x%02x Debounce started following Glitch\n", gpioMapTblPtr->PinId);
    }
#endif
  }

  // This is the start of Debounce processing. Step one is to notify the Meadow.Foundation
  // by sending an interrupt, unless one already sent by glitch filtering.

