WildernessLabs/Meadow/configs/stm32f777zit6-meadow/src/meadow-upd-interrupt.c
  gpioMapTblPtr->LastKnownGpioState = currentState;
  return gadrv_validtransitiondetected;
}

//==================================================================
// This code is only used for notifying Meadow.Core for debounce
int upd_meadow_debounce_notification_logic(struct interruptPinMap_s *gpioMapTblPtr)
{
  uint8_t newState;
  
#if MEADOW_UPD_INCLUDE_DIAGNOSTIC_SYSLOG > 0
  syslog(LOG_DEBUG, "upd-(debounce)-0x%02x Debounce alone, no Glitch\n", gpioMapTblPtr->PinId);
#endif

  switch(gpioMapTblPtr->GpioInterruptMode)
  {
    // Perfect debounce filtering is not possible due to the MCU not providing the GPIO
    // state that originally generated the interrupt. Therefore, we must assume that the
    // user is using it correctly and they understand what applications are appropriate.
    // All this is because we cannot accurately read the GPIO state at the instant we receive
    // the interrupt notification, it may have changed. If the desired interrupt mode is
    // 'rising' or 'falling' we assume the state based on the configuration, depending on
    // the MCU to only send the requested types. In the case of 'both' we have no choice
    // but to assume that the last known state was valid and send the opposite state.
    case rqstdintmode_both:
      // Assume the opposite state, that's the best we can do.
      // The LastKnownGpioState was updated after the debounce timeout period.
      newState = gpioMapTblPtr->LastKnownGpioState == 1 ? 0 : 1;
#if MEADOW_UPD_INCLUDE_DIAGNOSTIC_SYSLOG > 0
      syslog(LOG_DEBUG, "upd-(debounce)-0x%02x--Notifying 0x%02x rqstdintmode_both \n", gpioMapTblPtr->PinId, newState);
#endif
      upd_forward_interrupt_to_core(gpioMapTblPtr, newState);
      break;

    case rqstdintmode_falling:
      newState = 0;      // Assume high to low transition
#if MEADOW_UPD_INCLUDE_DIAGNOSTIC_SYSLOG > 0
      syslog(LOG_DEBUG, "upd-(debounce)-0x%02x--Notifying 0x%02x rqstdintmode_falling\n", gpioMapTblPtr->PinId, 0);
#endif
      upd_forward_interrupt_to_core(gpioMapTblPtr, newState);
      break;

    case rqstdintmode_rising:
      newState = 1;      // Assume low to high transition
#if MEADOW_UPD_INCLUDE_DIAGNOSTIC_SYSLOG > 0
      syslog(LOG_DEBUG, "upd-(debounce)-0x%02x--Notifying 0x%02x rqstdintmode_rising\n", gpioMapTblPtr->PinId, 1);
#endif
      upd_forward_interrupt_to_core(gpioMapTblPtr, 1);  
      break;

    case rqstdintmode_none:
    default:
      syslog(LOG_ERR, "%s@%d-0x%02x unexpected case:%d\n",
              __FILE__, __LINE__, gpioMapTblPtr->PinId, gpioMapTblPtr->GpioInterruptMode);
      break;
  }
  return OK;
}

//===============================================================
// Forward interrupt info to Meadow.Core
int upd_forward_interrupt_to_core(struct interruptPinMap_s *gpioMapTblPtr, uint8_t state)
{
  int ret;
  extern mqd_t s_int_queue;

  // Forward to Meadow.Core
  char queue_buffer[QUEUE_MSG_SIZE];
  queue_buffer[0] = gpioMapTblPtr->PinId;
  queue_buffer[1] = state;

  ret = mq_send(s_int_queue, queue_buffer, QUEUE_MSG_SIZE, 0);
  if(ret < 0)
  {
    if(errno == ENOMEM)
    {
      syslog(LOG_ERR, "0x%02x Queue overflow (too fast?)\n", gpioMapTblPtr->PinId);
    }
    else
    {
      syslog(LOG_ERR, "%s@%d-0x%02x mq_send failed:%d, errno:%d\n", __FILE__, __LINE__, 
          gpioMapTblPtr->PinId, ret, get_errno());
    }
  }

  return ret;
}

//===============================================================
uint8_t upd_read_current_gpio_state(struct interruptPinMap_s *gpioMapTblPtr)
{
  uint8_t pinNumb = gpioMapTblPtr->PinId & 0x0f;
  uint32_t idrRegisterValues = *((uint32_t *)(gpioMapTblPtr->IDRAddress));
  return (idrRegisterValues & (1 << pinNumb)) > 0 ? 1 : 0;
}

//===============================================================
// Adds are from the gpio isr
void upd_add_gpio_to_active_list(struct interruptPinMap_s *gpioMapTblPtr)
{
  // Find first empty slot
  for(int i = 0; i < MEADOW_UPD_F7_SUPPORTED_GPIOS; i++)
  {
    if(activeGpioPins[i] == NULL)
    {
      activeGpioPins[i] = gpioMapTblPtr;
      activeGpioPinCount++;
      break;
    }
  }
}

//===============================================================
// Removes are from the timer isr
int upd_remove_gpio_from_active_list(struct interruptPinMap_s *gpioMapTblPtr)
{
  int activeOffset;

  // Find the entry specified
  for(activeOffset = 0; activeOffset < MEADOW_UPD_F7_SUPPORTED_GPIOS; activeOffset++)
  {
    if(activeGpioPins[activeOffset] == gpioMapTblPtr)
      break;
  }

  if(activeOffset == MEADOW_UPD_F7_SUPPORTED_GPIOS)
    return -1;  // Not found

  activeGpioPinCount--;
  if(activeOffset == activeGpioPinCount)
  {
    // Remove the last entry in the array
    activeGpioPins[activeOffset] = NULL;
    return OK;
  }
 
  // Compress the list by moving the last entry to the now empty slot
  activeGpioPins[activeOffset] = activeGpioPins[activeGpioPinCount];
  activeGpioPins[activeGpioPinCount] = NULL;
  return OK;
}

//========================================================
// Timer settup is here. This should only be called once
// to prepare both timers for operation.
static int upd_config_interrupt_prep_timer(int stm32_timer_numb)
{
  int ret;
  struct stm32_tim_dev_s *tempTimer;

  // for 100 microsec
  uint32_t frequency = STM32_APB2_TIM10_CLKIN / 100; // 1,920,000 MHz;
  uint32_t period = 192 - 1;
  xcpt_t isrHandler = upd_periodic_timeout_isr;

  // For future reference
  // -- for 1 microsec --
  // frequency = STM32_APB2_TIM10_CLKIN;
  // period = 192 - 1;
  // -- for 1 millisec --
  // frequency = STM32_APB2_TIM10_CLKIN / 100; // = 1,920,000 MHz
  // period = 1920 - 1;                        // = 1 millisec
  
  tempTimer = stm32_tim_init(stm32_timer_numb);
  if(tempTimer == NULL)
  {
    syslog(LOG_ERR, "%s@%d-stm32_tim_init returned NULL\n",
          __FILE__, __LINE__);
    return OK;
  }
  
  // This determines the prescaler value 0 - 65535
  STM32_TIM_SETCLOCK(tempTimer, frequency);

  // Increasing period decreases the frequency
  STM32_TIM_SETPERIOD(tempTimer, period);

